public/personal/wedding.html
<!DOCTYPE html>
<html lang="en">
<head>
  <meta charset="UTF-8">
  <title>Wedding Review</title>
  <meta name="viewport" content="width=device-width, initial-scale=1">
  <meta name="description" content="">
  <meta name="keywords" content="">
  <link rel="stylesheet" href="/assets/css/main.css">
  <link rel="stylesheet" href="/assets/css/modus-operandi.css" id="noty-theme">
</head>
<body>
  <header class="noty-header">
    <nav class="noty-nav">
  <a href="/index.html" class="noty-nav-brand">Home</a>
  <ul class="noty-nav-list">
    <li><a href="/areas/index.html">Areas</a></li>
    <li><a href="/projects/index.html">Projects</a></li>
    <li><a href="/personal/index.html">Personal</a></li>
    <li><a href="/pages/manual.html">Manual</a></li>
  </ul>
  <div class="noty-nav-actions">
    <button class="theme-toggle" type="button" title="Toggle theme">🌓</button>
    <button class="sidenote-toggle" type="button" title="Toggle notes">☰</button>
  </div>
</nav>

  </header>
  <main class="page">
    <aside class="left-bar">
      <div id="toc"></div>
    </aside>
    <article class="content noty-article">
      <h1 class="noty-title">Wedding Review</h1>
      <div id="outline-container-orgd62a23e" class="outline-2">
<h2 id="orgd62a23e"><span class="section-number-2">1.</span> Ceremony</h2>
<div class="outline-text-2" id="text-1">
<p>
The ceremony it self was straight forward, one of the registrars took us to a different room beforehand to do get the pronouciation of our names right. We used the speakers they had in the room connected to a phone and had some music planned. We had a pretty minimal ceremony, no readings just music for the procession, recession and some ambiant music as various signatures were scribbled. 
</p>
</div>
</div>
<div id="outline-container-org419f5ba" class="outline-2">
<h2 id="org419f5ba"><span class="section-number-2">2.</span> Plan</h2>
<div class="outline-text-2" id="text-2">
<p>
We originally wanted a very small family only wedding, so we planned just the ceremony and some afternoon tea with around 16 people. But then as we got closer to the wedding day we realised we wanted friends as well. Luckliy we chose a fairly large ceremony room so we could get more people in just for the ceremony.  However, the afternoon tea can only hold a maximum of 20 people so after the ceremony we had to dismiss our Friends for the tea, and then we met up with just our friends in Small Bar for the evening. 
</p>
</div>
</div>
<div id="outline-container-orgb05c081" class="outline-2">
<h2 id="orgb05c081"><span class="section-number-2">3.</span> Charlotte</h2>
<div class="outline-text-2" id="text-3">
<p>
We discovered Charlotte while searching online for a Bristol-based photographer. We looked on her portfolio and saw that she had shots from the Christmas steps a location that was dear to us so we sent an email asking about our day and what we wanted. She sent us an offer which we accepted (informally). We then had a Zoom call to get to know each other and what we wanted, she was very friendly and just wanted to get know us a abit to better understand what we wanted and to put us at ease.
</p>

<p>
We wanted mostly candid moments of the day and some couple shots around the city, she had shot at all the locations we wanted so understod exactly what we wanted. We only needed half-day coverage to cover the morning from the Avon Gorge hotel to the afternon tea at Harbour Hotel. We had a rough idea of the timeline but she helped us structure it more and
from the start, everything felt straightforward and well organised on her side, from signing the contract to discussing timings and locations.
</p>

<p>
Since we didn’t have a wedding planner Charlotte was a brilliant source of guidance, she was helpful with questions regarding how the ceremony would unfold information we couldn't find on the website of the registry office. 
</p>

<p>
Close to the day we had a second zoom call to iron out final details so that everything flowed smoothly. During the day she blended into the background when appropriate to get the candid shots but was very accomodating of speicific shots some of the guests wanted.
</p>

<p>
Charlotte knew some fantastic photo spots around Bristol we have such lovely couple shots around the city thanks to her, including several that were special to us. She even stayed beyond her scheduled time to make sure we got a few extra shots, which we really appreciated.
</p>

<p>
Her communication was excellent throughout, and the turnaround time was rapid we received a sneak peeks within a couple of days and the full gallery just three weeks later. Charlotte is a lovely person to have with you on the day, and total professional! can't recommend her enough.
</p>
</div>
</div>
<div id="outline-container-org01839e6" class="outline-2">
<h2 id="org01839e6"><span class="section-number-2">4.</span> Makeup by Macy</h2>
<div class="outline-text-2" id="text-4">
<p>
makeupbymacy.com
</p>

<p>
Macy did an amazing job on my hair and makeup! I came to her with a vision for my hair that I wasn’t even sure would be achievable, but she absolutely exceeded my expectations and I received so many compliments on the day. As someone who doesn’t usually wear much makeup, she completely nailed the subtle yet dressy look I wanted, and I felt so confident thanks to the excellent job she did.
</p>

<p>
I found Macy through an online search for makeup artists in Bristol and booked a trial at her studio. The trial was great, she really listened to what I wanted, offered helpful suggestions, and made sure I was completely happy with the look.
</p>
</div>
</div>
<div id="outline-container-orga591ec0" class="outline-2">
<h2 id="orga591ec0"><span class="section-number-2">5.</span> Wedding</h2>
<div class="outline-text-2" id="text-5">
<p>
Some of our wedding guests stayed at the Avon Gorge by Hotel du Vin, we mostly picked due to proximity reasons but it turned out to be an ideal venue for pre ceremony photos. It has beautiful interiors and balcony with a great views of the gorge and the Clifton Suspension Bridge. 
</p>

<p>
Our ceremony took place at the Bristol Registry Office in the city centre, when we went for our notice giving and interview we were shown the inside of the room for the ceremony. We chose the crimson-walled “Red Room” (officially the Mayoral Room), and while I admit I was slightly taken aback by the bold colour at first, the light and setting of the room were beautiful and the photos turned out great. The two registrars involved were also very freindly and welcoming.  
</p>

<p>
Following the ceremony, we hosted our afternoon tea at the stylish Harbour Hotel right next to the registry office. The interioir is goergoesly decorated and the photos from there turned out so well. The staff were brilliant from start to finish. They were friendly, attentive, and incredibly accommodating, especially with a few dietary requirements in our group. Everything was well organised, and even though the space only seated around 20 people, it was ideal for our small gathering of family and close friends. The food was great, the scones were especially delicious, and everything felt freshly made and beautifully presented.
</p>
</div>
</div>
<div id="outline-container-orgd2a3843" class="outline-2">
<h2 id="orgd2a3843"><span class="section-number-2">6.</span> Roots</h2>
<div class="outline-text-2" id="text-6">
<p>
Roots Floral Designs has always been a special place for us we used to live right next to it and it’s where I bought flowers for Zoë on our very first Valentine’s Day back in 2016, so it was natural to have them create our wedding flowers too.
</p>

<p>
They offer beautfully designed set arrangements at extremely affordable prices. To us custom arrangements was not important, only that it looked like the very first flowers I bought all those years ago. So we just picked the arrangement that matched the valentines flowers and the buttonholes and ordered online.  
</p>

<p>
In the week leading up to the wedding, I popped into the shop a couple of times just to check in, and the team were always super friendly and very reassuring. They don’t usually open on Saturdays, but since our wedding was that day, we collected the flowers on Friday evening. The florists gave us clear, practical instructions on how to keep everything fresh overnight and were so understanding about the timing. They even reassured us that if there were any issues the next morning, we could email and they’d come in early on Saturday to sort it!
</p>

<p>
The flowers looked absolutely beautiful on the day and were still perfectly fresh. It felt really special to have flowers and a design from the same place that’s been part of our story from the beginning. 
</p>
</div>
</div>
<div id="outline-container-orgd99ff32" class="outline-2">
<h2 id="orgd99ff32"><span class="section-number-2">7.</span> Suit</h2>
<div class="outline-text-2" id="text-7">
<p>
I hired my wedding suit from Clifton Suits, a navy three-piece with a subtle tweed check, and was thoroughly impressed with both the quality and the service. From the initial fitting to the final collection, it was a smooth process.  A minor mix-up was resolved swiftly and without any fuss, which I greatly appreciated.
</p>

<p>
The suit fitted perfectly and was comfortable to wear throughout the day. I paired it with a navy trench coat from YMC, although the suit itself was more than warm enough.
</p>

<p>
I wore a pair of tan brogues by Loakes which I got from InStep in bristol. The husband and wife owners are also lovely people who were incredibly helpful, in factthe first pair the owner picked  was perfect, the man clealry knows his shoes. 
</p>
</div>
</div>
<div id="outline-container-org9f470c7" class="outline-2">
<h2 id="org9f470c7"><span class="section-number-2">8.</span> Dress</h2>
<div class="outline-text-2" id="text-8">
<p>
For my wedding outfit, I wore the elegant Afra bustier gown from crafted from Solace London. It was made of soft crêpe and satin with a subtle back slit that added a touch of glamour. Over it, I layered a wool- wrap coat from the white company with an exaggerated shawl collar and detachable tie belt — warm, chic, and the perfect complement to the simplicity of the dress.
</p>

<p>
To complete the look, I wore Rachel Simpson ivory peep-toe shoes, delicately adorned with double bows. They were my dream shoes (a lucky find on eBay for £35) and they made me feel every bit as special as I’d hoped.
</p>
</div>
</div>

      
    </article>
    <!-- notes-panel is created dynamically if missing -->
  </main>
  <footer class="noty-footer">
    <div class="noty-footer-inner">
  <p>Generated with <code>emacs-noty</code>.</p>
</div>

  </footer>
  <script src="/assets/js/theme.js"></script>
  <script src="/assets/js/site.js"></script>
  <script src="/assets/js/refs.js"></script>
  <script src="/assets/js/scroll-restore.js"></script>
  <script src="/assets/js/load-math-macros.js"></script>
  <script src="/assets/js/link-preview.js"></script>
  <script src="/assets/js/mathjax-config.js"></script>
<script src="https://cdn.jsdelivr.net/npm/mathjax@3/es5/tex-svg.js" id="MathJax-script"></script>

</body>
</html>
